renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
#include <stdio.h>
#include <string.h>

#include "FreeRTOS.h"

#include "platform.h"

#include "r_sci_rx_if.h"
#include "r_byteq_if.h"
#include "r_wifi_esp32_if.h"
#include "r_wifi_esp32_private.h"
#include "r_sci_rx_if.h"

#if !defined(WIFI_CFG_SCI_CHANNEL)
#error "Error! Need to define WIFI_CFG_SCI_CHANNEL in r_wifi_esp32_config.h"
#elif WIFI_CFG_SCI_CHANNEL == (0)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI0()
#define SCI_CH_wifi_serial_default           SCI_CH0
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH0_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH0_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (1)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI1()
#define SCI_CH_wifi_serial_default           SCI_CH1
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH1_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH1_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (2)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI2()
#define SCI_CH_wifi_serial_default           SCI_CH2
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH2_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH2_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (3)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI3()
#define SCI_CH_wifi_serial_default           SCI_CH3
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH3_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH3_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (4)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI4()
#define SCI_CH_wifi_serial_default           SCI_CH4
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH4_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH4_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (5)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI5()
#define SCI_CH_wifi_serial_default           SCI_CH5
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH5_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH5_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (6)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI6()
#define SCI_CH_wifi_serial_default           SCI_CH6
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH6_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH6_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (7)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI7()
#define SCI_CH_wifi_serial_default           SCI_CH7
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH7_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH7_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (8)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI8()
#define SCI_CH_wifi_serial_default           SCI_CH8
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH8_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH8_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (9)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI9()
#define SCI_CH_wifi_serial_default           SCI_CH9
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH9_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH9_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (10)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI10()
#define SCI_CH_wifi_serial_default           SCI_CH10
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH10_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH10_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (11)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI11()
#define SCI_CH_wifi_serial_default           SCI_CH11
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH11_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH11_RX_BUFSIZ
#elif WIFI_CFG_SCI_CHANNEL == (12)
#define R_SCI_PinSet_wifi_serial_default()   R_SCI_PinSet_SCI12()
#define SCI_CH_wifi_serial_default           SCI_CH12
#define SCI_TX_BUSIZ_DEFAULT                 SCI_CFG_CH12_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                 SCI_CFG_CH12_RX_BUFSIZ
#else
#error "Error! Invalid setting for WIFI_CFG_SCI_CHANNEL in r_wifi_esp32_config.h"
#endif

#define MUTEX_TX (1 << 0)
#define MUTEX_RX (1 << 1)

const uint8_t wifi_return_text_ok[]          = WIFI_RETURN_TEXT_OK;
const uint8_t wifi_return_text_error[]       = WIFI_RETURN_TEXT_ERROR;
const uint8_t wifi_return_text_ready[]       = WIFI_RETURN_TEXT_READY;
const uint8_t wifi_return_text_ok_go_send[]  = WIFI_RETURN_TEXT_OK_GO_SEND;
const uint8_t wifi_return_text_send_byte[]   = WIFI_RETURN_TEXT_SEND_BYTE;
const uint8_t wifi_return_text_send_ok[]     = WIFI_RETURN_TEXT_SEND_OK;
const uint8_t wifi_return_text_send_fail[]   = WIFI_RETURN_TEXT_SEND_FAIL;
const uint8_t wifi_return_text_busy[]        = WIFI_RETURN_TEXT_BUSY;
const uint8_t wifi_return_dummy[]   = "";

const uint32_t g_wifi_serial_buffsize_table[WIFI_NUMBER_OF_USE_UART][2] =
{
    /*SCI_TX_BUSIZ_DEFAULT*/ /*SCI_RX_BUSIZ_DEFAULT*/
    {SCI_TX_BUSIZ_DEFAULT,    SCI_RX_BUSIZ_DEFAULT,  }
};

const uint8_t * const wifi_result_code[WIFI_RETURN_ENUM_MAX][WIFI_RETURN_STRING_MAX] =
{
	/* text mode*/
	{wifi_return_text_ok},
	{wifi_return_text_error},
	{wifi_return_text_ready},
	{wifi_return_text_ok_go_send},
	{wifi_return_text_send_byte},
	{wifi_return_text_send_ok},
	{wifi_return_text_send_fail},
//	{wifi_return_text_busy},
	{wifi_return_dummy},
	{wifi_return_dummy},
};

wifi_system_status_t g_wifi_system_state = WIFI_SYSTEM_CLOSE;
uint8_t g_wifi_at_command_buff[WIFI_AT_COMMAND_BUFF_SIZE];
uint8_t g_wifi_at_response_buff[WIFI_AT_RESPONSE_BUFF_SIZE];

wifi_at_communication_info_t g_wifi_uart[WIFI_NUMBER_OF_USE_UART];
uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint8_t g_wifi_flash_write_certificates_num = 0;
uint16_t g_wifi_sysflash_header_listnum;

static void wifi_uart_callback_command_port(void *pArgs);
static void timeout_init(int32_t socket_no, uint16_t timeout_ms);
static void bytetimeout_init(int32_t socket_no, uint16_t timeout_ms);
static int32_t check_timeout(int32_t socket_no, int32_t rcvcount);
static int32_t check_bytetimeout(int32_t socket_no, int32_t rcvcount);
static int32_t wifi_serial_open(uint32_t);
static int32_t wifi_serial_close(void);
static int32_t wifi_execute_at_command(uint8_t serial_ch_id, uint8_t *ptextstring,
		uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_no);

static void socket_timeout_init(uint8_t socket_no, uint32_t timeout_ms, uint8_t flag);
static int32_t socket_check_timeout(uint8_t socket_no, uint8_t flag);
static int32_t wifi_take_mutex(uint8_t mutex_flag);
static void wifi_give_mutex(uint8_t mutex_flag);

