renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(dnsaddress1 == 0)
		{
			strcpy((char *)pcbuff,"AT+CIPDNS=1\r\n");
		}
		else if((dnsaddress2 != 0) && (dnsaddress2 != dnsaddress1))
		{
			sprintf((char *)pcbuff,"AT+CIPDNS=1,\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"\r\n",
					WIFI_ULONG_TO_IPV4BYTE_1(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_2(dnsaddress1),
					WIFI_ULONG_TO_IPV4BYTE_3(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress1),
					WIFI_ULONG_TO_IPV4BYTE_1(dnsaddress2), WIFI_ULONG_TO_IPV4BYTE_2(dnsaddress2),
					WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress2), WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress2));
		}
		else
		{
			sprintf((char *)pcbuff,"AT+CIPDNS=1,\"%d.%d.%d.%d\"\r\n",
					WIFI_ULONG_TO_IPV4BYTE_1(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_2(dnsaddress1),
					WIFI_ULONG_TO_IPV4BYTE_3(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress1));
		}
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;

}


wifi_err_t R_WIFI_ESP32_Connect (uint8_t *pssid, uint8_t *ppass, uint32_t security, uint8_t dhcp_enable, wifi_ip_configuration_t *pipconfig)
{
	int32_t i;
	int32_t ret;
	wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t mutex_flag;
	uint8_t *pcbuff = g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff;

	if((pssid == NULL) || (ppass == NULL) || ((security != WIFI_SECURITY_WPA) && (security != WIFI_SECURITY_WPA2)) || (pipconfig == NULL))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	if( 0 == R_WIFI_ESP32_IsConnected())
	{
		/* Nothing to do. */
		return WIFI_SUCCESS;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(0 == dhcp_enable)
		{
			/* DHCP Not Use */
			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CWDHCP=0,1\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			if(WIFI_SUCCESS == api_ret)
			{
				sprintf((char *)pcbuff,"AT+CIPSTA=\"%d.%d.%d.%d\",\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"\r\n",
						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->ipaddress), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->ipaddress),
						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->ipaddress), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->ipaddress),
						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->gateway), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->gateway),
						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->gateway), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->gateway),
						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->subnetmask), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->subnetmask),
						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->subnetmask), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->subnetmask));

				/* Set Static IP address */
				ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_STATIC_IP, 0xff);
				if(ret != 0)
				{
					api_ret = WIFI_ERR_MODULE_COM;
				}
			}
		}
		else
		{
			/* DHCP Use */
			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CWDHCP=1,1\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		sprintf(pcbuff,"AT+CWJAP=\"%s\",\"%s\"\r\n",pssid,ppass);
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, pcbuff, 30000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_CONNECT, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(0 == dhcp_enable)
		{
			g_wifi_ipconfig.ipaddress = pipconfig->ipaddress;
			g_wifi_ipconfig.subnetmask = pipconfig->subnetmask;
			g_wifi_ipconfig.gateway = pipconfig->gateway;
		}
		else
		{
			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPSTA?\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_IPADDRESS, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			else
			{
				pipconfig->ipaddress = g_wifi_ipconfig.ipaddress;
				pipconfig->subnetmask = g_wifi_ipconfig.subnetmask;
				pipconfig->gateway = g_wifi_ipconfig.gateway;
			}
		}
		g_wifi_system_state = WIFI_SYSTEM_CONNECT;
	}

	if(WIFI_SUCCESS == api_ret)
	{
		R_BSP_SoftwareDelay(2000,BSP_DELAY_MILLISECS);
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPSNTPTIME?\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}

	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}


wifi_err_t R_WIFI_ESP32_Disconnect (void)
{
	int32_t i;
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	if( WIFI_SYSTEM_OPEN == g_wifi_system_state)
	{
		/* Nothing to do. */
		return WIFI_SUCCESS;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CWQAP\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
		memset(&g_wifi_ipconfig, 0, sizeof(g_wifi_ipconfig));
		g_wifi_system_state = WIFI_SYSTEM_OPEN;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

int32_t R_WIFI_ESP32_IsConnected (void)
{
	int32_t ret = -1;

	if(WIFI_SYSTEM_CONNECT == g_wifi_system_state)
	{
		ret = 0;
	}
	return ret;
}

wifi_err_t R_WIFI_ESP32_GetMacAddress (uint8_t *pmacaddress)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(NULL == pmacaddress)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPSTAMAC?\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MACADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		memcpy(pmacaddress, g_wifi_macaddress, sizeof(g_wifi_macaddress));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

