renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_ESP32_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

	mutex_flag = MUTEX_TX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sended_length = 0;

		if(0 != timeout_ms)
		{
			socket_timeout_init(socket_no, timeout_ms, 0);
		}
		while(sended_length < length)
		{

			if(length - sended_length > g_wifi_tx_busiz_data)
			{
				current_send_length = g_wifi_tx_busiz_data;
			}
			else
			{
				current_send_length = length - sended_length;
			}

			if(current_send_length > WIFI_SOCKET_SENDABLE_DATASIZE)
			{
				current_send_length = WIFI_SOCKET_SENDABLE_DATASIZE;
			}

			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+CIPSEND=%d,%d\r\n" ,socket_no, current_send_length);

			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK_GO_SEND, WIFI_COMMAND_SET_SOCKET_SEND_START, socket_no);

			if(ret != 0)
			{
				break;
			}

			timeout = 0;

			timeout_init(WIFI_UART_COMMAND_PORT, 5000);
			ticket_no = wifi_set_request_in_queue( WIFI_COMMAND_SET_SOCKET_SEND_DATA, socket_no );
			g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag = 0;
			ercd = R_SCI_Send(g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle, pdata+sended_length, current_send_length);
			if(SCI_SUCCESS != ercd)
			{
				break;
			}

			while(1)
			{
				if(0 != g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag)
				{
					break;
				}
				vTaskDelay(1);
			}

			while(1)
			{
				get_queue = wifi_get_result_from_queue( ticket_no, &result);
				if(0 == get_queue)
				{
					break;
				}
				if(0 != timeout_ms)
				{
					if(-1 == check_timeout(WIFI_UART_COMMAND_PORT, 0))
					{
						wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
						timeout = 1;
						break;
					}
				}
				vTaskDelay(1);
			}

			if(1 == timeout)
			{
				break;
			}
			if(result != WIFI_RETURN_ENUM_SEND_OK)
			{
				break;
			}

			sended_length += current_send_length;
			if(-1 == socket_check_timeout(socket_no, 0))
			{
				break;
			}
		}
		api_ret = sended_length;

		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}

int32_t R_WIFI_ESP32_SocketRecv (int32_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	uint32_t recvcnt;
	uint32_t recv_length;
	uint32_t i;
	int32_t api_ret;
	volatile int32_t timeout;
	int32_t ret;
	byteq_err_t byteq_ret;
	uint8_t mutex_flag;

	if( (pdata == NULL) || (length <= 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_ESP32_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) ||  (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

	mutex_flag = MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
    {
		recvcnt = 0;

		if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
		{
			socket_timeout_init(socket_no, timeout_ms, 1);
		}

		while(1)
		{
			byteq_ret = R_BYTEQ_Get(g_wifi_socket[socket_no].socket_byteq_hdl, (pdata + recvcnt));
			if(BYTEQ_SUCCESS == byteq_ret)
			{
				recvcnt++;
				if(recvcnt >= length)
				{
					break;
				}
				continue;
			}
			if(g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED)
			{
				break;
			}
			if(g_wifi_system_state != WIFI_SYSTEM_CONNECT)
			{
				break;
			}
			if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
			{
				if(-1 == socket_check_timeout(socket_no, 1))
				{
					R_BSP_NOP();
					break;
				}
			}
			vTaskDelay(1);
		}
		api_ret = recvcnt;
		/* Give back the socketInUse mutex. */
    	wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}


wifi_err_t R_WIFI_ESP32_SocketShutdown (int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	int32_t subroutain_ret;
	uint8_t mutex_flag;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) ||
			(0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status <= WIFI_SOCKET_STATUS_SOCKET))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+CIPCLOSE=%d\r\n",socket_no);
		subroutain_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_no);
		if(subroutain_ret != 0)
		{
	    	api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_SOCKET;
		}
		/* Give back the mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;

}

wifi_err_t R_WIFI_ESP32_SocketClose (int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

	if(g_wifi_socket[socket_no].socket_create_flag == 1)
	{
		R_WIFI_ESP32_SocketShutdown (socket_no);
		R_BYTEQ_Flush(g_wifi_socket[socket_no].socket_byteq_hdl);
		g_wifi_socket[socket_no].ipversion = 0;
		g_wifi_socket[socket_no].protocol = 0;
		g_wifi_socket[socket_no].socket_create_flag = 0;
		g_wifi_socket[socket_no].ssl_flag = 0;
		g_wifi_socket[socket_no].ssl_type = 0;
		g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_CLOSED;
	}
	return api_ret;

