renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
}


wifi_err_t R_WIFI_ESP32_DnsQuery (uint8_t *pdomain_name, uint32_t *pipaddress)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == pdomain_name) || (NULL == pipaddress))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( 0 != R_WIFI_ESP32_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		strcpy((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+CIPDOMAIN=\"");
		sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff+strlen((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff),"%s\"\r\n",pdomain_name);

		func_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNSQUERY, 0xff);
		if(func_ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			*pipaddress = g_wifi_dnsaddress;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

	return api_ret;
}


wifi_err_t R_WIFI_ESP32_Ping (uint32_t ipaddr, uint16_t count, uint32_t intervalms)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	uint32_t i;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if ((0 == ipaddr) || (0 == count))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_ESP32_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	for(i=0;i<count;i++)
	{
	    mutex_flag = (MUTEX_TX | MUTEX_RX);
	    if(0 != wifi_take_mutex(mutex_flag))
		{
			api_ret = WIFI_ERR_TAKE_MUTEX;
		}
		if(WIFI_SUCCESS == api_ret)
		{
			strcpy((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+PING=\"");
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff+strlen((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff),"%d.%d.%d.%d\"\r\n",
					(uint8_t)(ipaddr >> 24),(uint8_t)((ipaddr >> 16) & 0xFF), (uint8_t)((ipaddr >> 8) & 0xFF), (uint8_t)((ipaddr) & 0xFF));
			func_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_PING, 0xff);
			if(func_ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			else
			{
			}
		}
		if(WIFI_ERR_TAKE_MUTEX != api_ret)
		{
			wifi_give_mutex(mutex_flag);
		}
		if(WIFI_SUCCESS == api_ret)
		{
			vTaskDelay(intervalms);
		}
		else
		{
			break;
		}
	}
	return api_ret;
}

wifi_err_t R_WIFI_ESP32_RegistSSLClientCertAndKey (uint8_t *p_cert, int32_t cert_len, uint8_t *p_key, int32_t key_len)
{
	wifi_err_t api_ret;
	if( (p_cert == NULL) || (cert_len <= 0 ) || (p_key == NULL) || (key_len <= 0))
	{
		return  WIFI_ERR_PARAMETER;
	}
	api_ret = R_WIFI_ESP32_RegistServerCertificate (2, p_cert, cert_len, 0);
	if(WIFI_SUCCESS == api_ret)
	{
		api_ret = R_WIFI_ESP32_RegistServerCertificate (3, p_key, key_len, 0);
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_flash_write_certificates_num = 1;
	}
	return api_ret;
}

int32_t R_WIFI_ESP32_ReadSSLClientCertAndKeyNum (void)
{
	int32_t api_ret = 0;
	int32_t key_num = 0;
	int32_t cert_num = 0;

	cert_num = R_WIFI_ESP32_ReadServerCertificateNum (2);
	if( 0 < cert_num)
	{
		key_num = R_WIFI_ESP32_ReadServerCertificateNum (3);
		if( 0 < key_num)
		{
			api_ret = key_num;
			if(api_ret < cert_num)
			{
				api_ret = cert_num;
			}
		}
	}
	if(0 < api_ret)
	{
		g_wifi_flash_write_certificates_num = 1;
	}
	else
	{
		g_wifi_flash_write_certificates_num = 0;
	}

	return api_ret;
}

wifi_err_t R_WIFI_ESP32_SocketOptSetTrustRootCertificate (int32_t socket_no, uint8_t *p_rootcert, int32_t rootcert_len)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	int32_t ret;
	uint8_t ssltype;
	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (p_rootcert == NULL) || (rootcert_len <= 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}
	api_ret = R_WIFI_ESP32_RegistTrustRootCertificate (p_rootcert, rootcert_len);
	if(WIFI_SUCCESS == api_ret)
	{
		api_ret = R_WIFI_ESP32_SetSslConfiguration (0, 2, 0, 0);
		if( 0 != ret )
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_socket[socket_no].ssl_type = ssltype;
	}
	return api_ret;

}

wifi_err_t R_WIFI_ESP32_RegistTrustRootCertificate (uint8_t *p_rootcert, int32_t rootcert_len)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	if( (p_rootcert == NULL) || (rootcert_len <= 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}
	api_ret = R_WIFI_ESP32_RegistServerCertificate (1, p_rootcert, rootcert_len, 0);
	if(WIFI_SUCCESS == api_ret)
	{
	}
	return api_ret;
}

wifi_err_t R_WIFI_ESP32_RegistServerCertificate (uint32_t datatype, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
	int32_t current_send_length;
	int32_t api_ret = WIFI_SUCCESS;
	int32_t ret;
	sci_err_t ercd;
	int8_t get_queue;
	wifi_return_code_t result;
	uint8_t mutex_flag;
	uint32_t ticket_no;

	uint8_t *buff;
	uint32_t file_header_len;
	uint32_t write_total_len;
	uint32_t padding_len;


	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}
	if( (datatype >= 4) || (datatype < 1))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}


	mutex_flag = MUTEX_TX | MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sended_length = 0;

		buff = (uint8_t *)pvPortMalloc( length + 16 ) ;
		if(NULL == buff)
		{
			/* Give back the socketInUse mutex. */
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		/* Magic Code */
		buff[0x00] = 0xF1;
		buff[0x01] = 0xF1;

		/* Item count = 1 */
		buff[0x02] = 0x01;
		buff[0x03] = 0x00;

		/* length =  */
	//	buff[0x04] = 0x01;
	//	buff[0x05] = 0x00;
	//	buff[0x06] = 0x00;
	//	buff[0x07] = 0x00;

		/* Type */
		buff[0x08] = datatype;

		/* ID (fix 0) */
		buff[0x09] = 0x00;

		/* content len */
		buff[0x0A] = (uint8_t)length;
		buff[0x0B] = (uint8_t)(length >> 8);

		/* raw data */
		memcpy(&buff[0x0C], pdata, length);

		/* padding */
		padding_len = ((4 - (length % 4)) % 4);
		if(0 < padding_len)
		{
			memset(&buff[0x0C + length],0xff,padding_len);
		}
		file_header_len = length + 4 + padding_len;

		/* length =  */
		buff[0x04] = (uint8_t)file_header_len;
		buff[0x05] = (uint8_t)(file_header_len >> 8);
		buff[0x06] = (uint8_t)(file_header_len >> 16);
		buff[0x07] = (uint8_t)(file_header_len >> 24);

		write_total_len = file_header_len + 8;

		switch(datatype)
		{
		case 0x01:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=1,\"client_ca\",0,%d\r\n" ,write_total_len);
			break;
		case 0x02:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=1,\"client_cert\",0,%d\r\n" ,write_total_len);
			break;
		case 0x03:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=1,\"client_key\",0,%d\r\n" ,write_total_len);
			break;
		}
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK_GO_WRITE, WIFI_COMMAND_SET_SYSFALSH_WRITE_START, 0xff);

