renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return WIFI_ERR_MODULE_COM;
		}

		while(sended_length < write_total_len)
		{
			if(write_total_len - sended_length > g_wifi_tx_busiz_data)
			{
				current_send_length = g_wifi_tx_busiz_data;
			}
			else
			{
				current_send_length = write_total_len - sended_length;
			}
			timeout = 0;

			timeout_init(WIFI_UART_COMMAND_PORT, 20000);
			ticket_no = wifi_set_request_in_queue( WIFI_COMMAND_SET_SYSFALSH_WRITE_DATA, 0 );
			g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag = 0;
			ercd = R_SCI_Send(g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle, buff+sended_length, current_send_length);
			if(SCI_SUCCESS != ercd)
			{
				break;
			}

			while(1)
			{
				if(0 != g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag)
				{
					break;
				}
			}
			sended_length += current_send_length;
		}
		while(1)
		{
			get_queue = wifi_get_result_from_queue( ticket_no, &result );
			if(0 == get_queue )
			{
				break;
			}

			if(-1 == check_timeout(WIFI_UART_COMMAND_PORT, 0))
			{
				timeout = 1;
				break;
			}
		}
		if(timeout == 1)
		{
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		if(result != WIFI_RETURN_ENUM_OK)
		{
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		/* Give back the socketInUse mutex. */
		vPortFree(buff);
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}

int32_t R_WIFI_ESP32_ReadServerCertificateNum (uint32_t datatype)
{
	int32_t api_ret = 0;
	int32_t ret;
	uint8_t mutex_flag;

	if( (datatype >= 4) || (datatype < 1))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}


	mutex_flag = MUTEX_TX | MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		switch(datatype)
		{
		case 0x01:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=2,\"client_ca\",0,6\r\n");
			break;
		case 0x02:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=2,\"client_cert\",0,6\r\n");
			break;
		case 0x03:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=2,\"client_key\",0,6\r\n");
			break;
		}
		g_wifi_sysflash_header_listnum = 0;
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_SYSFLASH, 0xff);

		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			api_ret = g_wifi_sysflash_header_listnum;
		}

		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}


wifi_err_t R_WIFI_ESP32_DeleteServerCertificate (uint32_t datatype, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
	int32_t current_send_length;
	int32_t api_ret;
	int32_t ret;
	sci_err_t ercd;
	int8_t get_queue;
	wifi_return_code_t result;
	uint8_t mutex_flag;
	uint32_t ticket_no;

	uint8_t *buff;
	uint32_t file_header_len;
	uint32_t write_total_len;
	uint32_t padding_len;


	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}
	if( (datatype >= 4) || (datatype < 1))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}


	mutex_flag = MUTEX_TX | MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sended_length = 0;

		buff = (uint8_t *)pvPortMalloc( length + 16 + 512 ) ;
		if(NULL == buff)
		{
			/* Give back the socketInUse mutex. */
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		/* Magic Code */
		buff[0x00] = 0xF1;
		buff[0x01] = 0xF1;

		/* Item count = 1 */
		buff[0x02] = 0x01;
		buff[0x03] = 0x00;

		/* length =  */
	//	buff[0x04] = 0x01;
	//	buff[0x05] = 0x00;
	//	buff[0x06] = 0x00;
	//	buff[0x07] = 0x00;

		/* Type */
		buff[0x08] = datatype;

		/* ID (fix 0) */
		buff[0x09] = 0x00;

		/* content len */
		buff[0x0A] = (uint8_t)length;
		buff[0x0B] = (uint8_t)(length >> 8);

		/* raw data */
		memcpy(&buff[0x0C], pdata, length);

		/* padding */
		padding_len = ((4 - (length % 4)) % 4);
		if(0 < padding_len)
		{
			memset(&buff[0x0C + length],0xff,padding_len);
		}
		file_header_len = length + 4 + padding_len;


		/* length =  */
		buff[0x04] = (uint8_t)file_header_len;
		buff[0x05] = (uint8_t)(file_header_len >> 8);
		buff[0x06] = (uint8_t)(file_header_len >> 16);
		buff[0x07] = (uint8_t)(file_header_len >> 24);

		write_total_len = file_header_len + 8;

		padding_len = ((4096 - (write_total_len % 4096)) % 4096);
		write_total_len += padding_len;

		switch(datatype)
		{
		case 0x01:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=0,\"client_ca\",0,%d\r\n" ,write_total_len);
			break;
		case 0x02:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=0,\"client_cert\",0,%d\r\n" ,write_total_len);
			break;
		case 0x03:
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+SYSFLASH=0,\"client_key\",0,%d\r\n" ,write_total_len);
			break;
		}
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK_GO_WRITE, WIFI_COMMAND_SET_SYSFALSH_WRITE_START, 0xff);

		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return WIFI_ERR_MODULE_COM;
		}

		if(timeout == 1)
		{
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		if(result != WIFI_RETURN_ENUM_OK)
		{
			vPortFree(buff);
			wifi_give_mutex(mutex_flag);
			return -1;
		}
		/* Give back the socketInUse mutex. */
		vPortFree(buff);
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}

uint32_t R_WIFI_ESP32_GetVersion(void)
{
    /* These version macros are defined in r_wifi_esp32_if.h. */
    return ((((uint32_t)WIFI_ESP32_VERSION_MAJOR) << 16) | (uint32_t)WIFI_ESP32_VERSION_MINOR);
}

static int32_t wifi_execute_at_command(uint8_t serial_ch_id, uint8_t *ptextstring, uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_no)
{
	volatile int32_t timeout;
	sci_err_t ercd;
	int8_t  get_queue;
	uint32_t recvcnt = 0;
	int32_t ret;
	wifi_return_code_t result;
	uint32_t ticket_no;

