renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
	timeout_init(serial_ch_id, timeout_ms);

	if(ptextstring != NULL)
	{
		timeout = 0;
		recvcnt = 0;

		ticket_no = wifi_set_request_in_queue( command, socket_no );
		g_wifi_uart[serial_ch_id].tx_end_flag = 0;
		ercd = R_SCI_Send(g_wifi_uart[serial_ch_id].wifi_uart_sci_handle, ptextstring, strlen((const char *)ptextstring));
		if(SCI_SUCCESS != ercd)
		{
			return -1;
		}

		while(1)
		{
			if(0 != g_wifi_uart[serial_ch_id].tx_end_flag)
			{
				break;
			}
			if(-1 == check_timeout(serial_ch_id, recvcnt))
			{
				wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
				timeout = 1;
				break;
			}
			vTaskDelay(1);
		}
		if(timeout == 1)
		{
			return -1;
		}
#if DEBUGLOG == 2
		R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL-1);
		printf("%s",ptextstring);
		R_BSP_CpuInterruptLevelWrite (0);
#endif
	}
	else
	{
		ticket_no = wifi_set_request_in_queue( command, socket_no );
	}
	while(1)
	{
		get_queue = wifi_get_result_from_queue( ticket_no, &result );
		if(0 == get_queue )
		{
			break;
		}

		if(-1 == check_timeout(serial_ch_id, recvcnt))
		{
			wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
			timeout = 1;
			break;
		}
		vTaskDelay(1);
	}
	if(timeout == 1)
	{
		return -1;
	}

	ret = -1;
	if(result == expect_code)
	{
		ret = 0;
	}
	return ret;
}


static void timeout_init(int32_t serial_ch, uint16_t timeout_ms)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	puart->starttime = xTaskGetTickCount();
	puart->endtime = puart->starttime + timeout_ms;
	if(puart->endtime < puart->starttime)
	{
		/* endtime value is overflow */
		puart->timeout_overflow_flag = 1;
	}
	else
	{
		puart->timeout_overflow_flag = 0;
	}
}

static int32_t check_timeout(int32_t serial_ch, int32_t rcvcount)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	if(0 == rcvcount)
	{
		puart->thistime = xTaskGetTickCount();
		if(puart->timeout_overflow_flag == 0)
		{
			if(puart->thistime >= puart->endtime || puart->thistime < puart->starttime)
			{
				/* Timeout  */
				return -1;
			}
		}
		else
		{
			if(puart->thistime < puart->starttime && puart->thistime >= puart->endtime)
			{
				/* Timeout  */
				return -1;
			}
		}
	}
	/* Not timeout  */
	return 0;
}

static void bytetimeout_init(int32_t serial_ch, uint16_t timeout_ms)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	puart->startbytetime = xTaskGetTickCount();
	puart->endbytetime = puart->startbytetime + timeout_ms;
	if(puart->endbytetime < puart->startbytetime)
	{
		/* overflow */
		puart->byte_timeout_overflow_flag = 1;
	}
	else
	{
		puart->byte_timeout_overflow_flag = 0;
	}
}

static int32_t check_bytetimeout(int32_t serial_ch, int32_t rcvcount)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	if(0 != rcvcount)
	{
		puart->thisbytetime = xTaskGetTickCount();
		if(puart->byte_timeout_overflow_flag == 0)
		{
			if(puart->thisbytetime >= puart->endbytetime || puart->thisbytetime < puart->startbytetime)
			{
				return -1;
			}
		}
		else
		{
			if(puart->thisbytetime < puart->startbytetime && puart->thisbytetime >= puart->endbytetime)
			{
				/* Timeout  */
				return -1;
			}
		}
	}
	/* Not timeout  */
	return 0;
}

static void socket_timeout_init(uint8_t socket_no, uint32_t timeout_ms, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *thistime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;

	wifi_socket_t *psocket;
	psocket = &g_wifi_socket[socket_no];

	if(0 == flag)
	{
		starttime             = &psocket->send_starttime ;
		thistime              = &psocket->send_thistime ;
		endtime               = &psocket->send_endtime ;
		timeout_overflow_flag = &psocket->send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &psocket->recv_starttime ;
		thistime              = &psocket->recv_thistime ;
		endtime               = &psocket->recv_endtime ;
		timeout_overflow_flag = &psocket->recv_timeout_overflow_flag;
	}
    *starttime = xTaskGetTickCount();
    *endtime = *starttime + timeout_ms;
    if(*endtime < *starttime)
    {
        /* overflow */
        *timeout_overflow_flag = 1;
    }
    else
    {
        *timeout_overflow_flag = 0;
    }

}

static int32_t socket_check_timeout(uint8_t socket_no, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *thistime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;
	wifi_socket_t *psocket;

	psocket = &g_wifi_socket[socket_no];
	if(0 == flag)
	{
		starttime             = &psocket->send_starttime ;
		thistime              = &psocket->send_thistime ;
		endtime               = &psocket->send_endtime ;
		timeout_overflow_flag = &psocket->send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &psocket->recv_starttime ;
		thistime              = &psocket->recv_thistime ;
		endtime               = &psocket->recv_endtime ;
		timeout_overflow_flag = &psocket->recv_timeout_overflow_flag;
	}

	*thistime = xTaskGetTickCount();
    if(*timeout_overflow_flag == 0)
    {
        if(*thistime >= *endtime || *thistime < *starttime)
        {
            return -1;
        }
    }
    else
    {
        if(*thistime < *starttime && *thistime <= *endtime)
        {
            /* Not timeout  */
            return -1;
        }
    }
    /* Not timeout  */
    return 0;
}

static int32_t wifi_take_mutex(uint8_t mutex_flag)
{
	if(0 != (mutex_flag & MUTEX_TX))
	{
		if( xSemaphoreTake( g_wifi_tx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
		{
        	return -1;
		}
	}

	if(0 != (mutex_flag & MUTEX_RX))
	{
		if( xSemaphoreTake( g_wifi_rx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
		{
			if(0 != (mutex_flag & MUTEX_TX))
			{
				xSemaphoreGive( g_wifi_tx_semaphore );
			}
			return -1;
		}
	}
	return 0;
}

static void wifi_give_mutex(uint8_t mutex_flag)
{
	if(0 != (mutex_flag & MUTEX_RX))
	{
		xSemaphoreGive( g_wifi_rx_semaphore);
	}
	if(0 != (mutex_flag & MUTEX_TX))
	{
		xSemaphoreGive( g_wifi_tx_semaphore);
	}
	return;
}


static int32_t wifi_serial_open(uint32_t baudrate)
{
	sci_err_t   my_sci_err;


	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.baud_rate    = baudrate;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.clk_src      = SCI_CLK_INT;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.data_size    = SCI_DATA_8BIT;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_en    = SCI_PARITY_OFF;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_type  = SCI_EVEN_PARITY;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.stop_bits    = SCI_STOPBITS_1;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_wifi_serial_default, SCI_MODE_ASYNC, &g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config, wifi_uart_callback_command_port, &g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle);

    if(SCI_SUCCESS != my_sci_err)
    {
    	return -1;
    }

	R_SCI_PinSet_wifi_serial_default();

