renesas/rx-driver-package/source/r_wifi_esp32/r_wifi_esp32_vx.xx/r_wifi_esp32/src/r_wifi_esp32_api.c
    return 0;

}

static int32_t wifi_serial_close(void)
{
    R_SCI_Close(g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle);
    return 0;
}

int32_t wifi_socket_init(void)
{
#if 0
	int i;
	for(i = 0;i<CREATEABLE_SOCKETS; i++)
	{
		if(BYTEQ_SUCCESS != R_BYTEQ_Open(g_wifi_socket[i].socket_recv_buff, sizeof(g_wifi_socket[i].socket_recv_buff), &g_wifi_socket[i].socket_byteq_hdl))
		{
			return -1;
		}
	}

    g_wifi_semaphore = xSemaphoreCreateMutex();

    if( g_wifi_semaphore == NULL )
    {
    	return -1;
    }
#endif
	/* Success. */
	return 0;

}

static void wifi_uart_callback_command_port(void *pArgs)
{
    sci_cb_args_t   *p_args;

    p_args = (sci_cb_args_t *)pArgs;

    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
	else if (SCI_EVT_TEI == p_args->event)
	{
		g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag = 1;
		R_BSP_NOP();

	}
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
        g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */
